# GetExWllClsrFrmSt

## Description
Gets the exclude wall closure from settings of a symbol definition, plug-in object style, or plug-in object.

```pascal
PROCEDURE GetExWllClsrFrmSt(
				hObject    : HANDLE;
				VAR left   : BOOLEAN;
				VAR right  : BOOLEAN;
				VAR top    : BOOLEAN;
				VAR bottom : BOOLEAN);
```

```python
def vs.GetExWllClsrFrmSt(hObject):
    return (left, right, top, bottom)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|The symbol definition, plug-in object style, or plug-in object.|
|left|BOOLEAN|Returns the exclude wall closure from left setting.|
|right|BOOLEAN|Returns the exclude wall closure from right setting.|
|top|BOOLEAN|Returns the exclude wall closure from top setting.|
|bottom|BOOLEAN|Returns the exclude wall closure from bottom setting.|

## Examples
```pascal
GetExWllClsrFrmSt(hObject, TRUE, FALSE, TRUE, TRUE);
```
```python
import vs

# Gets the exclude wall closure from settings of a symbol definition, plug-in
# object style, or plug-in object.
hObject = vs.FSActLayer()  # handle to the first selected object on the active layer

left, right, top, bottom = vs.GetExWllClsrFrmSt(hObject)
vs.Message('GetExWllClsrFrmSt returned: ' + str((left, right, top, bottom)))
```

## See Also
VS Functions:
SetExWllClsrFrmSt

## Version
Availability: from Vectorworks 2023

## Category
* Objects - Custom